spec/fixtures/services/ad_group_criterion_service/mutate_add_criterion_keyword-req.xml

<!-- Post to 'https://adwords-sandbox.google.com/api/adwords/cm/v200909/AdGroupCriterionService' -->
<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns="https://adwords.google.com/api/adwords/cm/v200909"
  xmlns:s="https://adwords.google.com/api/adwords/cm/v200909">
  <env:Header>
    <s:RequestHeader env:mustUnderstand="0">
      <authToken>***censured***<authToken>
      <userAgent>Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)</userAgent>
      <developerToken>***censured***<developerToken>
      <clientEmail>client_1+sem4ruby@gmail.com</clientEmail>
    </s:RequestHeader>
  </env:Header>
  <env:Body>
    <mutate xmlns="https://adwords.google.com/api/adwords/cm/v200909">

      <operations xsi:type="AdGroupCriterionOperation">
        <operator>ADD</operator>
        <operand xsi:type="BiddableAdGroupCriterion">
          <adGroupId>3060199926</adGroupId>
          <criterion xsi:type="Keyword">
            <text>paperino</text>
            <matchType>BROAD</matchType>
          </criterion>
        </operand>
      </operations>

    </mutate>
  </env:Body>
</env:Envelope>

